# Задача 2: Найдите сумму цифр трехзначного числа.
# *Пример:*
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)

num = int(input('Введите трехзначное число: '))
if (num < 100 or num > 999):
    print('Вы ввели не трехначное число')
else:
    a1 = num // 100
    a2 = (num % 100) // 10
    a3 = num % 10
    sum = a1 + a2 + a3
    print(f'{num} -> {sum} ({a1} + {a2} + {a3})') 